In [1]:
import sys
# !{sys.executable} -m pip install pymysql mysqlclient jupysql

In [2]:
import os
from dotenv import load_dotenv

load_dotenv()

True

In [3]:
# user = os.environ["DB_USERNAME"]
# pwd = os.environ["DB_PASSWORD"]
# host = os.environ["DB_HOST"]

In [4]:
%load_ext sql
%sql mysql+mysqldb://$DB_USERNAME:$DB_PASSWORD@$DB_HOST:3306/parks_and_recreation
%config SqlMagic.displaylimit = None

Connecting to 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

displaylimit: Value None will be treated as 0 (no limit)

## SQL_01

In [5]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [6]:
%%sql
SELECT first_name
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+
| first_name |
+------------+
|   Leslie   |
|    Tom     |
|   April    |
|   Jerry    |
|   Donna    |
|    Ann     |
|   Chris    |
|    Ben     |
|    Andy    |
|    Mark    |
|   Craig    |
+------------+

In [7]:
%%sql
SELECT first_name, last_name, birth_date
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+------------+
| first_name |  last_name   | birth_date |
+------------+--------------+------------+
|   Leslie   |    Knope     | 1979-09-25 |
|    Tom     |  Haverford   | 1987-03-04 |
|   April    |   Ludgate    | 1994-03-27 |
|   Jerry    |   Gergich    | 1962-08-28 |
|   Donna    |    Meagle    | 1977-07-30 |
|    Ann     |   Perkins    | 1988-12-01 |
|   Chris    |   Traeger    | 1980-11-11 |
|    Ben     |    Wyatt     | 1985-07-26 |
|    Andy    |    Dwyer     | 1989-03-25 |
|    Mark    | Brendanawicz | 1983-06-14 |
|   Craig    | Middlebrooks | 1986-07-27 |
+------------+--------------+------------+

In [8]:
%%sql
SELECT first_name,
last_name,
birth_date,
age,
age + 10 as op_1,
(age + 10) * 2 as op_2,
age + 10 * 2 as op_3 # example
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+------------+-----+------+------+------+
| first_name |  last_name   | birth_date | age | op_1 | op_2 | op_3 |
+------------+--------------+------------+-----+------+------+------+
|   Leslie   |    Knope     | 1979-09-25 |  44 |  54  | 108  |  64  |
|    Tom     |  Haverford   | 1987-03-04 |  36 |  46  |  92  |  56  |
|   April    |   Ludgate    | 1994-03-27 |  29 |  39  |  78  |  49  |
|   Jerry    |   Gergich    | 1962-08-28 |  61 |  71  | 142  |  81  |
|   Donna    |    Meagle    | 1977-07-30 |  46 |  56  | 112  |  66  |
|    Ann     |   Perkins    | 1988-12-01 |  35 |  45  |  90  |  55  |
|   Chris    |   Traeger    | 1980-11-11 |  43 |  53  | 106  |  63  |
|    Ben     |    Wyatt     | 1985-07-26 |  38 |  48  |  96  |  58  |
|    Andy    |    Dwyer     | 1989-03-25 |  34 |  44  |  88  |  54  |
|    Mark    | Brendanawicz | 1983-06-14 |  40 |  50  | 100  |  60  |
|   Craig    | Middlebrooks | 1986-07-27 |  37 |  47  |  94  |  57  |
+------------+--------------+------------+-----+------+------+------+

**PAMDAS**: Parentheses (Paréntesis), Exponents (Exponentes) , Multiplication-Division (Multiplicación-División), Addition-Subtraction (Suma y resta).

In [9]:
%%sql
SELECT distinct(gender), count(gender) as total
FROM parks_and_recreation.employee_demographics
GROUP BY gender
ORDER BY total desc;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+-------+
| gender | total |
+--------+-------+
|  Male  |   7   |
| Female |   4   |
+--------+-------+

## SQL_02